/**
 * Одномерный массив типа double.
 * Создать массив типа double с размером 4.
 * Записать в него любые значения с помощью блока для инициализации.
 * Вывести на консоль значение первого элемента.
 */
package lesson6;

public class II_OneDArrayDouble {
    public static void main(String[] args) {
        double[] arrayDouble = { 4.2, 5.8, 6, 7.1};
        System.out.println(arrayDouble[0]);
    }
}
